In [1]:
import pandas as pd
import sqlalchemy
import pymysql
engine = sqlalchemy.create_engine('mysql+pymysql://root:Silver@123@localhost:3306/salesordersdb')

#read sql table with pandas dataframe and specify datatypes

In [2]:
df = pd.read_sql_table("sales",engine)
df.dtypes

sales_index     int64
PROD_CODE      object
emp_id         object
year            int64
total_sales     int64
dtype: object

#read sql table

In [3]:
df = pd.read_sql_table("employees",engine)
df

   emp_id paygrade region          emp_name
0  EMP234      C13     NW    Bachmann, Jane
1  EMP244      C12     NW       Evans, Gina
2  EMP256      C11     NW     Lawson, Harry
3  EMP267      C14     SW  Clement, Beverly
4  EMP290      C12     SW      Allen, Maude

#join sql tables with query

In [4]:
query ='select total_sales,region from sales left outer join employees on sales.emp_id=employees.emp_id'
df = pd.read_sql_query(query,engine)
df

     total_sales region
0           2220     NW
1           1925     NW
2           1877     NW
3           1864     NW
4           1841     SW
..           ...    ...
155           42     NW
156          294     SW
157          305     SW
158           16     SW
159            5     SW

[160 rows x 2 columns]